In [1]:
import pandas as pd
import numpy as np

In [24]:
l=['a','b','c']

In [27]:
a=pd.Series(data=[sum,print,len])

In [38]:
ser1=pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])

In [39]:
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [40]:
ser2=pd.Series([1,2,5,4],['USA','GERMANY','ITALY','JAPAN'])

In [41]:
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [55]:
ser1+ser2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

In [56]:
ser3=pd.Series(data=l)

In [57]:
ser3

0     1
1     2
2     3
3     4
4    54
dtype: int64

In [58]:
from numpy.random import randn

In [59]:
np.random.seed(101)

In [62]:
df=pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
df['new']=df['W']+df['X']+df['Y']+df['Z']

In [79]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [84]:
df.drop('new',axis=1,inplace=True)

In [89]:
df.shape

(5, 4)

In [90]:
df['new']=5

In [92]:
df.drop('new', axis=1,inplace=True)

In [114]:
df.loc['A':'B',['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [163]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
res=df[df['W']>0]

In [141]:
res

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [156]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [168]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [171]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [180]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [181]:
d=df.reset_index()

In [188]:
d.set_index('index',inplace=True)

In [189]:
d.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='index')

In [190]:
d

              W         X         Y         Z
index
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509

In [196]:
newind='CA NY WY OR CO'.split()

In [197]:
df['states']=newind

In [201]:
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [205]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
i=list(zip(outside,inside))

In [206]:
i2=pd.MultiIndex.from_tuples(i)

In [209]:
i2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [210]:
df=pd.DataFrame(randn(6,2),i2,['A','B'])

In [211]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [217]:
df.loc['G2',2].loc['B']

0.07295967531703869

In [220]:
df.xs('G1')['A']

1    0.302665
2   -1.706086
3   -0.134841
Name: A, dtype: float64